# シェル自体の作業環境
brew "zsh"
tap "wyne/tap"; brew "wyne/tap/fasder"
brew "fzf"
brew "tmux"
brew "pam-reattach"

# Gitの作業環境
brew "git"
brew "tig"
brew "ghq"
brew "vim"
brew "gpg"
brew "pinentry-mac"

# 環境切り替え系
brew "mise"
brew "direnv"

# コマンド類
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gawk"
brew "jq"
brew "jnv"
brew "gron"
brew "tree"
brew "ctop"
brew "gh"
brew "eza"
brew "bat"
brew "tldr"
brew "ripgrep"
brew "git-delta"
tap "dlvhdr/formulae"; brew "dlvhdr/formulae/diffnav"
brew "httpie"
brew "curl"
brew "nkf"
tap "beeftornado/rmtree"; brew "beeftornado/rmtree/brew-rmtree"

# AWS
brew "awscli"
tap "aws/tap"; brew "aws/tap/aws-sam-cli"
cask "session-manager-plugin"

# Terraform
tap "hashicorp/tap"; brew "hashicorp/tap/terraform-ls"

# Alfred Workflowsに必要
brew "translate-shell"

# Gradle
brew "gradle-completion"

# DBクライアント
brew "mysql-client"
tap "oskamathis/redis-cli"; brew "oskamathis/redis-cli/redis-cli"
brew "mycli"
brew "iredis"

# シンタックスハイライト
brew "lesspipe"
brew "highlight"
brew "source-highlight"

# 環境構築に必要
brew "mackup"
cask "dropbox"

# フォント
cask "font-hackgen"
cask "font-hackgen-nerd"

# Quick Look
cask "qlmarkdown"
cask "syntax-highlight"

# GUIの作業環境
cask "google-japanese-ime"
cask "zen"
cask "microsoft-edge"
cask "alfred"
cask "bettertouchtool"
cask "karabiner-elements"
cask "fuwari"
cask "bartender"
cask "iterm2"
cask "visual-studio-code"
cask "intellij-idea"
cask "docker-desktop"
cask "postman"
cask "tableplus"
cask "cyberduck"
cask "appcleaner"
cask "keyboardcleantool"
cask "keycastr"
mas "Kindle", id: 302584613

# 業務用
cask "viscosity"
cask "krisp"
cask "finicky"
cask "zoom"
mas "Slack", id: 803453959
mas "Bitwarden", id: 1352778147

# プライベート
cask "spotify"
cask "notunes"
cask "discord"
cask "android-platform-tools"

