# Homebrew 外部コマンド系
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# シェル自体の作業環境
brew "zsh"
brew "fasd"
brew "fzf"
brew "tmux"
tap "fabianishere/personal"; brew "pam_reattach"

# Gitの作業環境
brew "git"
brew "tig"
brew "ghq"
brew "vim"
brew "gpg"
brew "pinentry-mac"

# 環境切り替え系
brew "asdf"
brew "direnv"

# コマンド類
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gawk"
brew "jq"
brew "jnv"
brew "gron"
brew "tree"
brew "ctop"
brew "gh"
brew "exa"
brew "bat"
brew "tldr"
brew "ripgrep"
brew "git-delta"
brew "httpie"
brew "curl"
tap "beeftornado/rmtree"; brew "brew-rmtree"

# AWS
brew "awscli"
tap "aws/tap"; brew "aws-sam-cli"
cask "session-manager-plugin"

# Terraform
tap "hashicorp/tap"; brew "terraform-ls"

# Alfred Workflowsに必要
brew "translate-shell"

# Gradle
brew "gradle-completion"

# DBクライアント
brew "mysql-client"
tap "aoki/redis-cli"; brew "redis-cli"
brew "mycli"
brew "iredis"

# シンタックスハイライト
brew "lesspipe"
brew "highlight"
brew "source-highlight"

# 環境構築に必要
brew "mackup"
cask "dropbox"

# フォント
tap "homebrew/cask-fonts"
cask "font-hackgen"
cask "font-hackgen-nerd"

# Quick Look
cask "qlmarkdown"
cask "syntax-highlight"

# GUIの作業環境
cask "google-japanese-ime"
cask "arc"
cask "alfred"
cask "bettertouchtool"
cask "karabiner-elements"
cask "fuwari"
cask "bartender"
cask "iterm2"
cask "visual-studio-code"
cask "intellij-idea"
cask "orbstack"
cask "postman"
cask "tableplus"
cask "cyberduck"
cask "appcleaner"
cask "keyboardcleantool"
cask "keycastr"
mas "Kindle", id: 302584613

# 業務用
cask "viscosity"
cask "krisp"
cask "zoom"
mas "Slack", id: 803453959
mas "Bitwarden", id: 1352778147

# プライベート
cask "spotify"
cask "discord"
cask "android-platform-tools"

