tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "zsh"
brew "tmux"
brew "git"
brew "tig"
brew "ghq"
brew "vim"
brew "fasd"
brew "fzf"

brew "anyenv"
brew "direnv"
brew "reattach-to-user-namespace"
brew "coreutils"
brew "jq"
brew "tree"
brew "beeftornado/rmtree/brew-rmtree"
brew "lesspipe"
brew "highlight"
brew "source-highlight"
brew "hub"

cask "iterm2"
cask "visual-studio-code"
cask "google-chrome"
cask "bettertouchtool"
cask "alfred"
cask "docker"

cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
